app/Controllers/Home.php

SELECT *
FROM `portofolio`
---
    public function index() : string {
        $portofolio = $this->portofolio->findAll();